class Character:
	def __init__(self, hp, damage, satiety, heal, mana, gold, lvl, xp):
		self.name = name
		self.hp = hp
		self.damage = damage
		self.satiety = satiety
		self.heal = heal
		self.mana = mana
		self.gold = gold
		self.lvl = lvl
		self.xp = xp


class gamee:
	def start:
		print("Миллионы лет назад началась великая война между людьми и монстрами")
		input()
		print("Мирный договор между рассами не долго сдерживал их ярость")
		input()
		print("Даже самым близкий друзьям пришлось воевать друг с другом")
		input()
		print("Жестокое побоище, растратевшая много ресурсов и жизней")
		input()
		print("Из-за людской яростной сплочённости, люди одержали верх и истребили всех монстров")
		input()
		print("Но никто не говорил, что проблема приходит одна..")
		print("Загрузка")
		input()
		print("Загрузка")
		input()
		print("Загрузка")
		input()
		print("Загрузка")
		while True:
			print("Вы проснулись на кровати в небольшом домике, находящимся в горах")
			b = int(input("Подойти к окну [1] \n Подойти к книжному шкафу [2] \n Поспать [3] \n Выйти в коридор [4]"))
			if b == 1:
				print("В окне виднеются горные холмы, покрытые снегом и сильный снегопад.")
			if b == 2:
				print("Пустой шкаф, с двумя-тремя валяющимеся в паутине книгами. Прочесть?")
				a = int(input("да[1] \n нет[2]"))
				if a = 1:
					print("Вы открыли первую попавшуюся книгу, после чего выбрали страницу с закладкой.")
					input()
					print("... начали ожесточённый побоища, КРОВЬ текла рекой, люди, взявшие секиры \n РАЗРУБАЛИ фури.. я хотел сказать монстров!")
					sa = int(input("Перелистнуть страницу [1] \n Отойти от шкафа [2]"))
					if sa == 1:
						print("Вы лизнули палец")
						input()
						print("Ваш палец скользит по странице..")
						input()
						print("Лист переворачивается..")
						input()
						print("АААААААААААААААААААА \n ТУТ ИЗОБРАЖЕНИЕ!!! УБЕРИТЕ ЭТУ МЕРЗОООСТЬ!!")
						input()
			if b == 3:
				print("Вы легли в мягкую и удоную постельку..")
				input()
				print("ZzZzZzZ")
				input()
				print("ZzZzZzZ")
				input()
				print("ZzZzZzZ")
				input()
				print("ZzZzZzZ")
				input()
				print("ZzZzZzZ")
				input()
				print("ZzZzZzZ")
			    input()
			    print("Вы оказались в странной комнате..")
			    son1 = int(input("Кричать [1] \n Биться об стену [2]"))
			    if son1 == 1:
			    	print("В комнате появилась дверь")
			    	input()
			    	print("Вы открывате её..")
			    	input()
			    	input()
			    	input()
			    	print("АААААА \n КРОВЬ!! ОНИ СНОВА ЗДЕСЬ!!!")
			    	input()
			    	print("Вы проснулись")
			if b == 4:
				print("Вы вышли в коридор \n На вешалке висит пальто с железными накладками, в конце коридора дверь")
				sdas = int(input("Надеть пальто и выйти из дома[1] \n Вернуться обратно[2]"))
				if sdad = 1:
					print("Вы уверены, что хотите покинуть дом? \n Вы можете многое упустить, не осмотревшись здесь")
					zzx = int(input("Остаться [1] уйти [2]"))
					if zzx = 1:
						break
		while True:
			print("Зимний горный лес. Интересно, зачем ты здесь?")
			input()
			while True:
				print("В далеке виднеется какой-то свет. Приблизиться?")
				qwe = int(input("Да [1] \n Нет [2]"))
				if qwe = 1:
					print("Вы подошли ближе, там была яма, из которой бил свет")
					input()
					print("Вам становится плохо")
					input()
					print("Что происходит?")



